# Basic analysis using SQL queries 

### Setting

The task is to prepare an analytical report for the HR department. Based on the analysis, make recommendations for the HR department on recruitment strategy, as well as on interaction with existing employees. The database contains a set of tables with data about employees of a fictitious company. Review the company's workforce. Develop a set of research questions and then test them against the data.

In [4]:
import pandas as pd
import urllib.request as req
import json
import sqlalchemy
import psycopg2
import pymongo

In [295]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/human_resources'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

hr_dataset = pd.read_sql('Select * from hr_dataset', connect)
production_staff = pd.read_sql('Select * from production_staff', connect)
recruiting_costs = pd.read_sql('Select * from recruiting_costs', connect)
salary_grid = pd.read_sql('Select * from salary_grid', connect)

### Hypothesis No. 1: Marriage affects the quality of work.

In [296]:
q1 = '''SELECT "Performance Score", 
                ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) AS percentage_of_married 
        FROM hr_dataset 
        GROUP BY "Performance Score"
        ORDER BY percentage_of_married
                                        '''
PS_percentage_of_married  = pd.read_sql(q1, connect)
PS_percentage_of_married

          Performance Score  percentage_of_married
0               Exceptional                   11.0
1                   Exceeds                   36.0
2  N/A- too early to review                   38.0
3               Fully Meets                   40.0
4         Needs Improvement                   40.0
5                       PIP                   44.0
6              90-day meets                   48.0

### Conclusion:
The data can confirm this hypothesis. You can also add that an unmarried employee works better, since the “percentage of married people” is lowest for employees with the highest performance indicators.

### Hypothesis No. 2: Since the enterprise is a manufacturing enterprise, the enterprise is dominated by men.

In [297]:
q2 = '''SELECT ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100) as percentage_of_male, 
                (100 - ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100)) as percentage_of_female 
        FROM hr_dataset 
        '''

percent_sex  = pd.read_sql(q2, connect)
percent_sex

   percentage_of_male  percentage_of_female
0                43.0                  57.0

### Conclusion:
The data shows the opposite.

### Hypothesis No. 3: Men work better than women.

For the study, we neutralize the factor of unequal gender distribution by multiplying by a factor of 0.87 (50/57 = 0.87) the number of men grouped by quality of work. Thus, we will see the real ratio of men and women in groups according to the quality of work as if their overall ratio were 50 to 50.
<br>_Note:_ this method is not accurate, it is an estimate.

In [298]:
q3 = '''SELECT "Performance Score", 
                ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid)*0.87 AS FLOAT)*100) as percentage_of_male, 
                (100 - ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid)*0.87 AS FLOAT)*100)) as percentage_of_female 
        FROM hr_dataset 
        GROUP BY "Performance Score"
        ORDER BY percentage_of_male '''

PS_sex  = pd.read_sql(q3, connect)
PS_sex

          Performance Score  percentage_of_male  percentage_of_female
0  N/A- too early to review                34.0                  66.0
1              90-day meets                44.0                  56.0
2                   Exceeds                49.0                  51.0
3               Fully Meets                51.0                  49.0
4               Exceptional                51.0                  49.0
5                       PIP                51.0                  49.0
6         Needs Improvement                77.0                  23.0

### Conclusion:
According to the data, we see that, in general, women and men are distributed approximately equally in all groups. The hypothesis was not justified.

### Hypotheses No. 4, 5, 6:
    - There is a connection between the quality of work and the age of the employee.
    - There is a connection between the quality of work and the length of service of the employee.
    - There is a connection between the quality of work and the employee’s salary.

In [299]:
q4 = '''SELECT "Performance Score", 
                ROUND(AVG(age)) as avg_age,
                ROUND(AVG("Days Employed")) as avg_days_employed,
                ROUND(AVG("Pay Rate")) as avg_pay_rate
        FROM hr_dataset
        GROUP BY "Performance Score" 
        ORDER BY avg_days_employed'''

PS_age_DE_PR = pd.read_sql(q4, connect)
PS_age_DE_PR

          Performance Score  avg_age  avg_days_employed  avg_pay_rate
0  N/A- too early to review     35.0              552.0          28.0
1              90-day meets     38.0             1056.0          32.0
2         Needs Improvement     36.0             1366.0          33.0
3               Fully Meets     40.0             1406.0          32.0
4                       PIP     40.0             1427.0          30.0
5                   Exceeds     41.0             1627.0          30.0
6               Exceptional     38.0             1701.0          38.0

### Conclusions:
  - According to the data, we see that there is no connection between the quality of work and the age of the employee.
  - Judging by the data, there is definitely a connection between quality and work experience.
  - There is a connection between the quality of work and remuneration; it is clearly visible in the Exceptional column; “excellent” students, on average, receive the most. Interns - the least of all. The fact that those who meet the requirements (Exceeds) receive less than those whose quality needs improvement (Needs Improvement) can be explained by the unequal distribution of workers of different salary specializations in these groups.

### Hypothesis No. 7:
Most likely, the majority of such workers are those whose quality of work meets the requirements.

In [300]:
q5 = '''SELECT "Performance Score",
                ROUND(COUNT("Performance Score")/(SUM(COUNT("Performance Score")) OVER()),2)*100 as allocation 
        FROM hr_dataset 
        GROUP BY "Performance Score"
                                        '''

PS_allocation = pd.read_sql(q0, connect)
PS_allocation

          Performance Score  allocation
0               Exceptional         3.0
1              90-day meets        10.0
2  N/A- too early to review        12.0
3               Fully Meets        58.0
4                   Exceeds         9.0
5                       PIP         3.0
6         Needs Improvement         5.0

### Conclusion:
The hypothesis was confirmed.

### Research 1:
The goal is to identify those managers under whose leadership there are the most employees with one or another indicator of work quality.

In [301]:
q6 ='''WITH Ranked_Orderd AS 
            (SELECT "Performance Score", 
                    "Manager Name",
                    count, 
                    RANK() OVER (PARTITION BY "Performance Score" ORDER BY count DESC) AS rnk 
            FROM (SELECT "Performance Score", 
                        "Manager Name",
                        COUNT(*) as count 
                    FROM hr_dataset 
                    GROUP BY "Performance Score", "Manager Name") g) 
        SELECT "Performance Score", STRING_AGG("Manager Name",', ') as "Manager Name"
        FROM Ranked_Orderd 
        WHERE rnk = 1 
        GROUP BY "Performance Score"
        ORDER BY "Performance Score" '''

PS_manager_name  = pd.read_sql(q6, connect)
PS_manager_name

          Performance Score                  Manager Name
0              90-day meets                    Simon Roup
1                   Exceeds                Brannon Miller
2               Exceptional    Brannon Miller, Simon Roup
3               Fully Meets  Kelley Spirea, David Stanley
4  N/A- too early to review                Michael Albert
5         Needs Improvement                Michael Albert
6                       PIP                Brannon Miller

### Recommendation:
Pay attention to the work of manager Michael Albert

### Research 2:
The goal is to identify the positions for which, according to statistics, this or that source of personnel “specializes.”

In [302]:
q7 ='''WITH Ranked_Orderd AS 
            (SELECT position,
                    "Employee Source",
                    count, 
                    RANK() OVER (PARTITION BY position ORDER BY count DESC) rnk
                    FROM (SELECT position, "Employee Source", COUNT(*) as count  
                    FROM hr_dataset 
                    GROUP BY position, "Employee Source") g)
        SELECT position, STRING_AGG("Employee Source", ', ') as "Employee Source"
        FROM Ranked_Orderd 
        WHERE rnk = 1 
        GROUP BY position
        ORDER BY position 
                                    '''
PS_manager_name  = pd.read_sql(q7, connect)
PS_manager_name

,position,Employee Source
0,Accountant I,"Website Banner Ads, Diversity Job Fair, Intern..."
1,Administrative Assistant,"Website Banner Ads, Pay Per Click - Google, Di..."
2,Area Sales Manager,Website Banner Ads
3,BI Developer,Indeed
4,BI Director,Professional Society
5,CIO,Employee Referral
6,Data Architect,Indeed
7,Database Administrator,Employee Referral
8,Director of Operations,Other
9,Director of Sales,MBTA ads
10,IT Director,Professional Society
11,IT Manager - DB,"Professional Society, Diversity Job Fair"
12,IT Manager - Infra,Diversity Job Fair
13,IT Manager - Support,Professional Society
14,IT Support,"Diversity Job Fair, Information Session, Glass..."
15,Network Engineer,Employee Referral
16,President & CEO,Pay Per Click - Google
17,Production Manager,Employee Referral
18,Production Technician I,Search Engine - Google Bing Yahoo
19,Production Technician II,Newspager/Magazine
20,Sales Manager,"Diversity Job Fair, Social Networks - Facebook..."
21,Senior BI Developer,Indeed
22,Shared Services Manager,"Monster.com, Diversity Job Fair"
23,Software Engineer,"Diversity Job Fair, Pay Per Click - Google"
24,Software Engineering Manager,Search Engine - Google Bing Yahoo
25,Sr. Accountant,"Diversity Job Fair, Other"
26,Sr. DBA,Vendor Referral
27,Sr. Network Engineer,Employee Referral

### Recommendation:
When selecting people for a specific vacancy, you can be guided by this table, which shows statistically the most popular source of personnel for the vacancy for this position.

### Research 3:
- The goal is to  see which sources indicate that the staff have the longest work experience. This may indicate a more reliable source of personnel.
- How personnel sources are ranked by the average age of employees, the percentage of men and women who came to the enterprise through a specific channel. This can help when deciding which channel to post a job on.
- And also from which states are the employees

In [303]:
q8 = '''SELECT "Employee Source", 
                ROUND(AVG("Days Employed")) as "Days Employed" 
        FROM hr_dataset 
        GROUP BY "Employee Source" 
        ORDER BY "Days Employed" DESC
                                        '''

ES_Days_employed  = pd.read_sql(q8, connect)
ES_Days_employed

                           Employee Source  Days Employed
0                            Careerbuilder         2428.0
1                                    Other         1910.0
2                                Billboard         1681.0
3                                 MBTA ads         1580.0
4                      Information Session         1552.0
5                       Website Banner Ads         1471.0
6                     Professional Society         1417.0
7                              Monster.com         1403.0
8                       Diversity Job Fair         1340.0
9        Search Engine - Google Bing Yahoo         1325.0
10                  Pay Per Click - Google         1287.0
11                         Internet Search         1274.0
12                       Employee Referral         1252.0
13                    On-campus Recruiting         1214.0
14                      Newspager/Magazine         1194.0
15                               Glassdoor         1135.0
16  Social Networks - Facebook Twitter etc         1083.0
17                           Word of Mouth         1023.0
18                         Vendor Referral         1022.0
19              Company Intranet - Partner          444.0
20                                  Indeed          308.0
21                 On-line Web application          194.0
22                           Pay Per Click            2.0

In [304]:
q9 = '''SELECT "Employee Source", ROUND(AVG(age)) as avg_age 
                FROM hr_dataset 
                GROUP BY "Employee Source"
                ORDER BY avg_age
                
                    '''

ES_age = pd.read_sql(q9, connect)
ES_age

                           Employee Source  avg_age
0                                    Other     34.0
1                       Newspager/Magazine     35.0
2                   Pay Per Click - Google     35.0
3                            Word of Mouth     36.0
4                                   Indeed     36.0
5                       Website Banner Ads     36.0
6                                Glassdoor     36.0
7   Social Networks - Facebook Twitter etc     36.0
8                      Information Session     36.0
9                          Internet Search     38.0
10                    Professional Society     38.0
11                                MBTA ads     38.0
12                           Careerbuilder     40.0
13                         Vendor Referral     40.0
14                    On-campus Recruiting     40.0
15                 On-line Web application     40.0
16                             Monster.com     41.0
17                       Employee Referral     41.0
18                      Diversity Job Fair     42.0
19       Search Engine - Google Bing Yahoo     43.0
20              Company Intranet - Partner     43.0
21                           Pay Per Click     45.0
22                               Billboard     45.0

In [305]:
q10 = '''SELECT "Employee Source",  
                ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100) as percentage_of_male, 
                (100 - ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100)) as percentage_of_female
                FROM hr_dataset
                GROUP BY "Employee Source" 
                ORDER BY percentage_of_male DESC
                                                '''

ES_sex = pd.read_sql(q10, connect)
ES_sex

,Employee Source,percentage_of_male,percentage_of_female
0,Pay Per Click,100.0,0.0
1,Careerbuilder,100.0,0.0
2,On-line Web application,100.0,0.0
3,Company Intranet - Partner,100.0,0.0
4,Information Session,75.0,25.0
5,Employee Referral,65.0,35.0
6,Indeed,62.0,38.0
7,Website Banner Ads,54.0,46.0
8,MBTA ads,53.0,47.0
9,Internet Search,50.0,50.0
10,On-campus Recruiting,50.0,50.0
11,Professional Society,50.0,50.0
12,Diversity Job Fair,48.0,52.0
13,Word of Mouth,46.0,54.0
14,Pay Per Click - Google,43.0,57.0
15,Social Networks - Facebook Twitter etc,36.0,64.0
16,Newspager/Magazine,33.0,67.0
17,Glassdoor,29.0,71.0
18,Monster.com,29.0,71.0
19,Vendor Referral,27.0,73.0
20,Billboard,25.0,75.0
21,Search Engine - Google Bing Yahoo,24.0,76.0
22,Other,22.0,78.0

In [306]:
q_11 ='''SELECT state, COUNT(state) as number_of_employees
        FROM hr_dataset
        GROUP BY state
        ORDER BY number_of_employees
        DESC
        LIMIT 5'''

state_count= pd.read_sql(q_11, connect)
state_count

  state  number_of_employees
0    MA                  275
1    CT                    6
2    TX                    3
3    VT                    2
4    OR                    1

### Research 4:
The goal is to check for what reason employees leave or are fired by department.

In [307]:
q12 ='''WITH Ranked_Orderd AS 
            (SELECT     department,
                    "Reason For Term",
                    count, 
                    RANK() OVER (PARTITION BY department ORDER BY count DESC) AS rnk 
        FROM
            (SELECT "Reason For Term", 
                        department,
                        COUNT(*) as count 
                    FROM hr_dataset 
                    GROUP BY department, "Reason For Term") g) 
        SELECT department, STRING_AGG("Reason For Term",', ') AS "Reason For Term" 
        FROM Ranked_Orderd 
        WHERE rnk = 2  
        GROUP BY
        department
         '''
dзе_Reason_for_term  = pd.read_sql(q12, connect)
dзе_Reason_for_term

             department                                    Reason For Term
0         Admin Offices                                      career change
1                 IT/IS                                              hours
2  Software Engineering       Another position, attendance, medical issues
3                 Sales  attendance, Another position, relocation out o...
4     Production                                          Another position

### Conclusions:
Sufficiently strict conclusions can be drawn only for those departments where there is a main reason for the end of work.
- For the _Admin Offices_ division: The reason is a change in the type of activity by the employee themselves.
- For the _IT/IS_ division: Let's assume that "hours" as the reason for dismissal is abbreviated as increased work hours. That is, the reason for ending work is dismissal of one’s own free will due to increased workload and as a result of overtime.
- For the _Production_ division: The reason is a change of position, that is, most likely career growth when moving to another company.
### Recommendations:
- For the IT department, hire more employees, hire a good manager, so as not to overload employees with overtime work.
- Create a career elevator within the company for production personnel.

### Research 5:
When assessing the work of a manager and, for example, making a decision on the rotation of managers, you can choose as a guideline the average length of service of employees, the percentage of gender of employees under his leadership, the average age of the employee.

In [308]:
q13 = '''SELECT "Manager Name", ROUND(AVG("Days Employed")) as days_employed 
        FROM hr_dataset
        GROUP BY "Manager Name" 
        ORDER BY days_employed DESC 
                                    '''

MN_DE  = pd.read_sql(q13, connect)
MN_DE

          Manager Name  days_employed
0   Board of Directors         2610.0
1         Eric Dougall         2384.0
2        Lynn Daneault         1777.0
3      Jennifer Zamora         1694.0
4           Janet King         1620.0
5           John Smith         1599.0
6       Brannon Miller         1592.0
7        Ketsia Liebig         1490.0
8        Kelley Spirea         1387.0
9         Elijiah Gray         1374.0
10       David Stanley         1370.0
11     Alex Sweetwater         1320.0
12  Brandon R. LeBlanc         1233.0
13      Debra Houlihan         1163.0
14      Webster Butler         1125.0
15      Michael Albert         1098.0
16            Amy Dunn         1078.0
17      Kissy Sullivan         1047.0
18        Peter Monroe          943.0
19          Simon Roup          679.0
20    Brian Champaigne          308.0

In [309]:
q14 = '''SELECT "Manager Name", ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100) as percentage_of_male,
                (100 - ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100)) as percentage_of_female 
        FROM hr_dataset
        GROUP BY "Manager Name"
                                '''
MN_sex  = pd.read_sql(q14, connect)
MN_sex

          Manager Name  percentage_of_male  percentage_of_female
0     Brian Champaigne                62.0                  38.0
1       Michael Albert                45.0                  55.0
2           Simon Roup                47.0                  53.0
3           John Smith                57.0                  43.0
4             Amy Dunn                38.0                  62.0
5       Brannon Miller                38.0                  62.0
6       Webster Butler                43.0                  57.0
7   Brandon R. LeBlanc                29.0                  71.0
8           Janet King                53.0                  47.0
9        Lynn Daneault                54.0                  46.0
10        Elijiah Gray                14.0                  86.0
11     Alex Sweetwater                33.0                  67.0
12       David Stanley                33.0                  67.0
13        Peter Monroe                57.0                  43.0
14        Eric Dougall                25.0                  75.0
15     Jennifer Zamora               100.0                   0.0
16  Board of Directors                 0.0                 100.0
17       Kelley Spirea                55.0                  45.0
18      Kissy Sullivan                41.0                  59.0
19       Ketsia Liebig                33.0                  67.0
20      Debra Houlihan                33.0                  67.0

In [310]:
q15 = '''SELECT "Manager Name",
                ROUND(AVG(age)) as avg_age
                FROM hr_dataset
                GROUP BY "Manager Name"
                ORDER BY avg_age DESC 
                                        '''
MN_age = pd.read_sql(q15, connect)
MN_age

          Manager Name  avg_age
0   Board of Directors     51.0
1      Jennifer Zamora     44.0
2        Kelley Spirea     42.0
3           Janet King     41.0
4           John Smith     41.0
5       Brannon Miller     41.0
6       Webster Butler     41.0
7         Elijiah Gray     40.0
8        Lynn Daneault     39.0
9             Amy Dunn     39.0
10        Eric Dougall     39.0
11      Kissy Sullivan     38.0
12      Michael Albert     38.0
13        Peter Monroe     38.0
14       Ketsia Liebig     37.0
15          Simon Roup     37.0
16    Brian Champaigne     36.0
17       David Stanley     36.0
18     Alex Sweetwater     34.0
19  Brandon R. LeBlanc     31.0
20      Debra Houlihan     30.0

### Research 6:
Subject: percentage of work quality by department.

In [311]:
q16 ='''WITH table_3 AS
    (WITH table_2 AS 
    (WITH table_1 AS 
    (SELECT COALESCE(abcdef.dpt_10, g.dpt_11) as dpt_12, "90-day meets", "PIP", "Needs Improvement", "Fully Meets", "Exceeds", "Exceptional", "N/A- too early to review" 
    FROM 
        (SELECT COALESCE(abcde.dpt_8, f.dpt_9) as dpt_10, "90-day meets", "PIP", "Needs Improvement", "Fully Meets", "Exceeds", "Exceptional" 
        FROM 
            (SELECT COALESCE(abcd.dpt_6, e.dpt_7) as dpt_8, "90-day meets", "PIP", "Needs Improvement", "Fully Meets", "Exceeds" 
            FROM 
                (SELECT COALESCE(abc.dpt_4, d.dpt_5) as dpt_6, "90-day meets", "PIP", "Needs Improvement", "Fully Meets" 
                FROM 
                    (SELECT COALESCE(ab.dpt_2, c.dpt_3) as dpt_4, "90-day meets", "PIP", "Needs Improvement"  
                    FROM 
                        (SELECT COALESCE(a.dpt_0, b.dpt_1) as dpt_2, "90-day meets", "PIP"  
                        FROM 
                            (SELECT department as dpt_0 , COUNT("Performance Score") as "90-day meets" FROM hr_dataset WHERE perf_scoreid = 0 GROUP BY dpt_0) a
                            FULL OUTER JOIN 
                            (SELECT department as  dpt_1, COUNT("Performance Score") as "PIP" FROM hr_dataset WHERE perf_scoreid = 1 GROUP BY dpt_1) b
                            ON 1 = 2) ab 
                            FULL OUTER JOIN 
                            (SELECT department as  dpt_3, COUNT("Performance Score") as "Needs Improvement" FROM hr_dataset WHERE perf_scoreid = 2 GROUP BY dpt_3) c 
                            ON 1 = 2) abc 
                            FULL OUTER JOIN  
                            (SELECT department as  dpt_5, COUNT("Performance Score") as "Fully Meets" FROM hr_dataset WHERE perf_scoreid = 3 GROUP BY dpt_5) d 
                            ON 1 = 2) abcd 
                            FULL OUTER JOIN  
                            (SELECT department as  dpt_7, COUNT("Performance Score") as "Exceeds" FROM hr_dataset WHERE perf_scoreid = 4 GROUP BY dpt_7) e 
                            ON 1 = 2) abcde 
                            FULL OUTER JOIN 
                            (SELECT department as  dpt_9, COUNT("Performance Score") as "Exceptional" FROM hr_dataset WHERE perf_scoreid = 5 GROUP BY dpt_9) f
                            ON 1 = 2) abcdef 
                            FULL OUTER JOIN 
                            (SELECT department as  dpt_11, COUNT("Performance Score") as "N/A- too early to review" FROM hr_dataset WHERE perf_scoreid = 9 GROUP BY dpt_11) g 
                            ON 1 = 2)
    SELECT 
    dpt_12 as department,
    CASE WHEN "90-day meets" IS NULL THEN 0 ELSE "90-day meets" END,
    CASE WHEN "PIP" IS NULL THEN 0 ELSE "PIP" END,
    CASE WHEN "Needs Improvement" IS NULL THEN 0 ELSE "Needs Improvement" END,
    CASE WHEN "Fully Meets" IS NULL THEN 0 ELSE "Fully Meets" END,
    CASE WHEN "Exceeds" IS NULL THEN 0 ELSE "Exceeds" END, 
    CASE WHEN "Exceptional" IS NULL THEN 0 ELSE "Exceptional" END,
    CASE WHEN "N/A- too early to review" IS NULL THEN 0 ELSE "N/A- too early to review" END
    FROM table_1) 
    
    SELECT
    department,
    
    SUM("90-day meets") AS "90-day meets",
    SUM("PIP") AS "PIP",
    SUM("Needs Improvement") AS "Needs Improvement",
    SUM("Fully Meets") AS "Fully Meets",
    SUM("Exceeds") AS "Exceeds",
    SUM("Exceptional") AS "Exceptional",
    SUM("N/A- too early to review") AS "N/A- too early to review",
    
    SUM("90-day meets") + 
    SUM("PIP") + 
    SUM("Needs Improvement") +
    SUM("Fully Meets") + 
    SUM("Exceeds") + 
    SUM("Exceptional") + 
    SUM("N/A- too early to review")
    
    AS total_by_dpt
    
    FROM table_2
    GROUP BY department)
    
    SELECT 
    department,
    
    ROUND("90-day meets"/total_by_dpt, 2)*100 AS "90-day meets",
    ROUND("PIP"/total_by_dpt, 2)*100 AS "PIP",
    ROUND("Needs Improvement"/total_by_dpt, 2)*100 AS "Needs Improvement",
    ROUND("Fully Meets"/total_by_dpt, 2)*100 AS "Fully Meets",
    ROUND("Exceeds"/total_by_dpt,2)*100 AS "Exceeds",
    ROUND("Exceptional"/total_by_dpt, 2)*100 AS "Exceptional",
    ROUND("N/A- too early to review"/total_by_dpt,2)*100 AS "N/A- too early to review"
    
    FROM
    
    table_3
    
    '''

department_ps_percents = pd.read_sql(q16, connect)
department_ps_percents

,department,90-day meets,PIP,Needs Improvement,Fully Meets,Exceeds,Exceptional,N/A- too early to review
0,Production,9.0,3.0,5.0,58.0,11.0,2.0,12.0
1,Admin Offices,10.0,0.0,0.0,70.0,0.0,0.0,20.0
2,Executive Office,0.0,0.0,0.0,100.0,0.0,0.0,0.0
3,IT/IS,16.0,0.0,2.0,52.0,4.0,8.0,18.0
4,Software Engineering,20.0,0.0,10.0,50.0,10.0,10.0,0.0
5,Sales,6.0,6.0,6.0,71.0,6.0,0.0,3.0

### Conclusion:
This study, for example, will help draw up planned quality indicators for the department. (100% - line amount)

### Research 7:
Identification of the department with the highest “staff turnover”

In [312]:
#Department -  Days Employed

q17 = '''SELECT "department", 
                ROUND(AVG("Days Employed")) as avg_days_employed 
                FROM hr_dataset 
                GROUP BY "department"
                ORDER BY avg_days_employed
                                            '''

department_DE = pd.read_sql(q17, connect)
department_DE

             department  avg_days_employed
0                 IT/IS              982.0
1     Production                    1308.0
2  Software Engineering             1418.0
3         Admin Offices             1421.0
4                 Sales             1622.0
5      Executive Office             1973.0

# Conclusion:
The IT department is in first place in terms of “staff turnover”

### Research 8:
Subject: Distribution by gender among units.

In [313]:
#Department -  sex

q18= ''' SELECT "department",
            ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100) as percentage_of_male, 
            (100 - ROUND(CAST(SUM(genderid) AS FLOAT)/CAST(COUNT(genderid) AS FLOAT)*100)) as percentage_of_female 
            FROM hr_dataset GROUP BY "department"
                                                         '''

department_sex = pd.read_sql(q18, connect)
department_sex

             department  percentage_of_male  percentage_of_female
0     Production                       39.0                  61.0
1         Admin Offices                40.0                  60.0
2                 IT/IS                56.0                  44.0
3      Executive Office                 0.0                 100.0
4  Software Engineering                40.0                  60.0
5                 Sales                52.0                  48.0

### Conclusion:
There is no risk of gender discrimination in departments.

### Research 9:
Subject: Distribution by average age and salary by department.

In [314]:
#Department -  age

q19 = '''SELECT "department",
                ROUND(AVG(age)) as avg_age 
                FROM hr_dataset 
        GROUP BY "department"
        ORDER BY avg_age DESC
                                '''
department_age = pd.read_sql(q19, connect)
department_age

             department  avg_age
0      Executive Office     63.0
1     Production            39.0
2                 Sales     39.0
3                 IT/IS     38.0
4  Software Engineering     36.0
5         Admin Offices     32.0

In [315]:
#Department -  Pay Rate

q20 = ''' SELECT "department", ROUND(AVG("Pay Rate")) as avg_pay_rate 
            FROM hr_dataset 
            GROUP BY "department"
            ORDER BY avg_pay_rate DESC 
                                        '''

department_PR = pd.read_sql(q20, connect)
department_PR

             department  avg_pay_rate
0      Executive Office          80.0
1                 Sales          56.0
2  Software Engineering          49.0
3                 IT/IS          46.0
4         Admin Offices          32.0
5     Production                 23.0

### Conclusion:
This research will help in creating vacancies for a particular position.

### Research 10:
The goal is to find out how work experience is related to salary and age indicators.

In [316]:
#years_employed percent avg_PR avg_age

q23 = '''WITH am as 
        (WITH 
            below_one AS 
               (SELECT COUNT("Days Employed") as DE, AVG("Pay Rate") as avg_pr, ROUND(AVG("age")) as avg_age, '1' as years_employed
                FROM hr_dataset
                WHERE 
                "Days Employed" < 360),
            one_three AS 
                (SELECT COUNT("Days Employed") as DE, AVG("Pay Rate") as avg_pr, ROUND(AVG("age")) as avg_age, '1-3' as years_employed
                FROM hr_dataset
                WHERE 
                ("Days Employed" >= 360) AND ("Days Employed" < 1080)),
            three_five AS
                (SELECT COUNT("Days Employed") as DE, AVG("Pay Rate") as avg_pr, ROUND(AVG("age")) as avg_age, '3-5' as years_employed
                FROM hr_dataset
                WHERE
                ("Days Employed" >= 1080) AND ("Days Employed"< 1800)),
           five_ten AS 
                (SELECT COUNT("Days Employed") as DE, AVG("Pay Rate") as avg_pr, ROUND(AVG("age")) as avg_age, '5-10' as years_employed
                FROM hr_dataset
                WHERE
                ("Days Employed" >= 1800) AND ("Days Employed" < 3600)),
            above_ten AS
                (SELECT COUNT("Days Employed") as DE, AVG("Pay Rate") as avg_pr, ROUND(AVG("age")) as avg_age, '_10' as years_employed
                FROM hr_dataset
                WHERE
                "Days Employed" >= 3600)
            
            
            (SELECT de, ROUND(avg_pr) as avg_pr, avg_age, years_employed 
            FROM 
             below_one
             )
            UNION 
            (SELECT de, ROUND(avg_pr) as avg_pr, avg_age, years_employed
            FROM 
             one_three)
            UNION
             (SELECT de, ROUND(avg_pr) as avg_pr, avg_age, years_employed
            FROM 
             three_five)
            UNION
            (SELECT de, ROUND(avg_pr) as avg_pr, avg_age, years_employed 
            FROM 
             five_ten)
               UNION
            (SELECT de, ROUND(avg_pr) as avg_pr, avg_age, years_employed
            FROM 
             above_ten))
             
              
            SELECT years_employed,ROUND(CAST(de as FLOAT)/310*100) AS percent, avg_pr,avg_age
            FROM
            am
            ORDER BY years_employed
            
            
            
                             '''

years_employed = pd.read_sql(q23, connect)
years_employed

  years_employed  percent  avg_pr  avg_age
0              1     12.0    30.0     38.0
1            1-3     26.0    33.0     37.0
2            3-5     38.0    30.0     41.0
3           5-10     23.0    33.0     38.0
4            _10      1.0    31.0     38.0

# Conclusion:
Dividing the data into age groups, we see that:
- most of the workers have experience from 3 to 5 years, and this same group is the oldest
- indicator of the highest average salary in groups of work experience from 1 to 3 years and from 5 to 10 years

### Research 11:
Let's find out how the age of the employee is related to the salary indicator, as well as in which age group the most employees are married.

In [317]:
#Age percent avg_PR percentage_of_married

q24 = '''WITH am as 
        (WITH 
            below_30 AS 
               (SELECT COUNT("age") as pc, AVG("Pay Rate") as avg_pr, '30' as age, ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) as percentage_of_married
                FROM hr_dataset
                WHERE 
                "age" < 30),
            _30_35 AS 
                (SELECT COUNT("age") as pc, AVG("Pay Rate") as avg_pr, '30-35' as age, ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) as percentage_of_married
                FROM hr_dataset
                WHERE 
                ("age" > 30) AND ("age" < 35)),
            _35_40 AS
                (SELECT COUNT("age") as pc, AVG("Pay Rate") as avg_pr, '35-40' as age, ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) as percentage_of_married
                FROM hr_dataset
                WHERE 
                ("age" > 35) AND ("age" < 40)),
            _40_45 AS 
                (SELECT COUNT("age") as pc, AVG("Pay Rate") as avg_pr, '40-45' as age, ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) as percentage_of_married
                FROM hr_dataset
                WHERE 
                ("age" > 40) AND ("age" < 45)),
            _45_50 AS
                (SELECT COUNT("age") as pc, AVG("Pay Rate") as avg_pr, '45-50' as age, ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) as percentage_of_married
                FROM hr_dataset
                WHERE 
                ("age" > 45) AND ("age" < 50)),
            _50_55 AS
                (SELECT COUNT("age") as pc, AVG("Pay Rate") as avg_pr, '50-55' as age, ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) as percentage_of_married
                FROM hr_dataset
                WHERE 
                ("age" > 50) AND ("age" < 55)),
            above_55 AS
                (SELECT COUNT("age") as pc, AVG("Pay Rate") as avg_pr, '55' as age, ROUND(CAST(SUM(marriedid) AS FLOAT)/CAST(COUNT(marriedid) AS FLOAT)*100) as percentage_of_married
                FROM hr_dataset
                WHERE 
                ("age" > 55) )
            
            
            (SELECT pc, ROUND(avg_pr) as avg_pr, age, percentage_of_married
            FROM 
             below_30
             )
            UNION 
            (SELECT pc, ROUND(avg_pr) as avg_pr, age, percentage_of_married
            FROM 
             _30_35)
            UNION
             (SELECT pc, ROUND(avg_pr) as avg_pr, age, percentage_of_married
            FROM 
             _35_40)
            UNION
            (SELECT pc, ROUND(avg_pr) as avg_pr, age, percentage_of_married
            FROM 
             _40_45)
            UNION
            (SELECT pc, ROUND(avg_pr) as avg_pr, age, percentage_of_married
            FROM 
             _45_50)
            UNION
            (SELECT pc, ROUND(avg_pr) as avg_pr, age, percentage_of_married
            FROM 
             _50_55)
            UNION
            (SELECT pc, ROUND(avg_pr) as avg_pr, age, percentage_of_married
            FROM 
             above_55)
             
             
             
             )
             
              
            SELECT age, ROUND(CAST(pc as FLOAT)/310*100) as percent, avg_pr, percentage_of_married
            FROM
            am
            ORDER BY age
            
            
            
                             '''

age = pd.read_sql(q24, connect)
age

     age  percent  avg_pr  percentage_of_married
0     30     12.0    35.0                   47.0
1  30-35     24.0    30.0                   38.0
2  35-40     16.0    31.0                   39.0
3  40-45     12.0    28.0                   58.0
4  45-50      8.0    35.0                   19.0
5  50-55      6.0    33.0                   30.0
6     55      5.0    32.0                   57.0

### Conclusions:
- the largest age group is from 30 to 35 years
- workers in the age groups up to 30 and from 45 to 50 receive the most
- most of them are married between the ages of 40 and 45

### Research 12:
We will identify candidates for dismissal among production workers. As an indicator of efficiency, we take the sum of Abutments/Hour Wk 1 and Abutments/Hour Wk 2

In [318]:
#List of the worst of Production Stuff 

q25 = '''WITH tbl_1 as
        (WITH tbl as
                (SELECT "Employee Name",
                        "Abutments/Hour Wk 1", 
                        "Abutments/Hour Wk 2",
                        "Daily Error Rate",
                        "90-day Complaints",
                        ("Abutments/Hour Wk 1" + "Abutments/Hour Wk 2") as efficiency,
                        RANK() OVER(ORDER BY "Daily Error Rate" DESC) AS rnk
                FROM 
                production_staff
                WHERE   ("Abutments/Hour Wk 1" is not null) 
                    AND ("Abutments/Hour Wk 2" is not null) 
                    AND ("Abutments/Hour Wk 1" != 0) 
                    AND ("Abutments/Hour Wk 2" != 0) 
                ORDER BY efficiency, rnk
                ASC
                LIMIT 70)
            SELECT  "Employee Name",
                    "Abutments/Hour Wk 1", 
                    "Abutments/Hour Wk 2",
                    "Daily Error Rate",
                    "90-day Complaints",
                    efficiency,
                    rnk, 
                    RANK() OVER(ORDER BY "90-day Complaints" DESC) AS rnk_1
                    
            FROM tbl
            ORDER BY efficiency, rnk, rnk_1
            ASC
            LIMIT 30)
            
            SELECT "Employee Name" as "bounce candidates"
            FROM tbl_1
            LIMIT 10

        
                             '''

prod_staff_rating = pd.read_sql(q25, connect)
prod_staff_rating

       bounce candidates
0         Foreman, Tanya
1           O'hare, Lynn
2        Desimone, Carl
3         DiNocco, Lily
4            Smith, Sade
5  Williams, Jacquelyn
6       McCarthy, Brigit
7          Demita, Carla
8      Robinson, Alain
9      Estremera, Miguel

### Research 13:
The goal is to calculate the unit cost of a personnel according to the source of personnel in order to identify the most expensive channels.

In [319]:
q26 = '''SELECT COALESCE(a.es1, b.es2) AS "Employment Source", a.number_of_employees, b.total_cost, 
        b.total_cost/a.number_of_employees AS "costs per unit"
        FROM
            (SELECT "Employee Source" AS es1, 
                    COUNT("Employee Source") AS number_of_employees
            FROM 
            hr_dataset
            GROUP BY
            "Employee Source"
            ORDER BY
            number_of_employees
            DESC) a

            FULL JOIN

            (SELECT "Employment Source" AS es2, "Total" AS total_cost
            FROM 
            recruiting_costs
            ORDER BY total_cost
            DESC ) b
            ON
            a.es1=b.es2
        
    ORDER BY "costs per unit"
    DESC
        
        
                '''


costs_per_unit = pd.read_sql(q26, connect)
costs_per_unit

,Employment Source,number_of_employees,total_cost,costs per unit
0,Indeed,8,NaN,NaN
1,Careerbuilder,1,7790.0,7790.0
2,Pay Per Click,1,1323.0,1323.0
3,MBTA ads,17,10980.0,645.0
4,On-campus Recruiting,12,7500.0,625.0
5,Website Banner Ads,13,7143.0,549.0
6,Social Networks - Facebook Twitter etc,11,5573.0,506.0
7,Newspager/Magazine,18,8291.0,460.0
8,Other,9,3995.0,443.0
9,Billboard,16,6192.0,387.0
10,Diversity Job Fair,29,10021.0,345.0
11,Monster.com,24,5760.0,240.0
12,Search Engine - Google Bing Yahoo,25,5183.0,207.0
13,Pay Per Click - Google,21,3509.0,167.0
14,Professional Society,20,1200.0,60.0
15,Word of Mouth,13,0.0,0.0
16,Information Session,4,0.0,0.0
17,Glassdoor,14,0.0,0.0
18,Internet Search,6,0.0,0.0
19,On-line Web application,1,0.0,0.0
20,Vendor Referral,15,0.0,0.0
21,Company Intranet - Partner,1,0.0,0.0
22,Employee Referral,31,0.0,0.0

### Conclusion:
The data shows that attracting talent through Careerbuilder and Pay Per Click resources can be stopped.
These are the most expensive sources in terms of unit costs.

In [320]:
q27 = '''SELECT "department", "position"
        FROM  hr_dataset
        WHERE 
        ("Employee Source" = 'Careerbuilder') 
        OR
        ("Employee Source" = 'Pay Per Click') 
        OR
        ("Employee Source" ='Social Networks - Facebook Twitter etc')
        '''

department_position  = pd.read_sql(q27, connect)
department_position

           department                  position
0   Production          Production Technician I
1   Production          Production Technician I
2   Production          Production Technician I
3   Production          Production Technician I
4   Production          Production Technician I
5   Production          Production Technician I
6   Production          Production Technician I
7   Production          Production Technician I
8   Production          Production Technician I
9   Production         Production Technician II
10  Production         Production Technician II
11              Sales        Area Sales Manager
12              Sales             Sales Manager

### besides:
According to study No. 2, specialists (Production Technician I, Production Technician II) can be found through Search Engine - Google Bing Yahoo and Newspager/Magazine, through which they are much more likely to be found. + consider Social Networks as a candidate for termination of funding, since the channel is also ineffective.

### Research 14:
The goal is to elicit which departments have the most candidates for dismissal.

In [321]:
q28 = '''SELECT "department", COUNT("department")
        FROM  hr_dataset
        WHERE 
        ("Performance Score" = 'PIP') 
        OR
        ("Performance Score" = 'Needs Improvement') 
        AND
        ("Employment Status" = 'Active')
        GROUP BY "department"
        '''

dpts_with_bounce_candidates  = pd.read_sql(q28, connect)
dpts_with_bounce_candidates

          department  count
0              IT/IS      1
1              Sales      4
2  Production            11

### Conclusion:
Accordingly, money from reducing funding for ineffective channels can be spent on additional funding for top channels by department. The research shows the direction to which specific channels the funds can be directed, for example, if it is advertising vacancies and payment, for example, for impressions or for places in search results.

In [322]:
q28 ='''WITH Ranked_Orderd AS 
            (SELECT "Employee Source",
                    department, 
                    count, 
                    RANK() OVER (PARTITION BY "Employee Source" ORDER BY count DESC) rnk
                    FROM (SELECT department, "Employee Source", COUNT(*) as count  
                    FROM hr_dataset 
                    GROUP BY department, "Employee Source") g)
        SELECT department, STRING_AGG("Employee Source", ', ') as employee_source 
        FROM Ranked_Orderd 
        WHERE rnk = 1 
        GROUP BY department
        ORDER BY department
                                    '''
PS_department_1  = pd.read_sql(q28, connect)
PS_department_1

          department                                    employee_source
0              IT/IS  Indeed, Company Intranet - Partner, Informatio...
1  Production         Glassdoor, Information Session, Internet Searc...
2              Sales                                 Website Banner Ads

##### The table below will help distribute this funding in more detail, if necessary:

### Research 15:
Subject: percentage of personnel sources by department.

In [323]:
q29 = '''WITH tbl_2 AS 
        (WITH tbl_1 AS 
        (WITH tbl AS 
        (WITH k_req AS (SELECT department, "Employee Source" as ES FROM hr_dataset)
         SELECT COALESCE(abcdefghijklmnopqrstuv.dpt_43, w.dpt_44) as dpt_45, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral", "Glassdoor", "Indeed", "Vendor Referral", "Website Banner Ads", "On-campus Recruiting", "Information Session", "Diversity Job Fair"
        FROM
        (SELECT COALESCE(abcdefghijklmnopqrstu.dpt_41, v.dpt_42) as dpt_43, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral", "Glassdoor", "Indeed", "Vendor Referral", "Website Banner Ads", "On-campus Recruiting", "Information Session"
        FROM
            (SELECT COALESCE(abcdefghijklmnopqrst.dpt_39, u.dpt_40) as dpt_41, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral", "Glassdoor", "Indeed", "Vendor Referral", "Website Banner Ads", "On-campus Recruiting"
            FROM
                (SELECT COALESCE(abcdefghijklmnopqrs.dpt_37, t.dpt_38) as dpt_39, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral", "Glassdoor", "Indeed", "Vendor Referral", "Website Banner Ads" 
                FROM
                    (SELECT COALESCE(abcdefghijklmnopqr.dpt_35, s.dpt_36) as dpt_37, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral", "Glassdoor", "Indeed", "Vendor Referral"  
                    FROM
                        (SELECT COALESCE(abcdefghijklmnopq.dpt_33, r.dpt_34) as dpt_35, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral", "Glassdoor", "Indeed"
                        FROM
                            (SELECT COALESCE(abcdefghijklmnop.dpt_31, q.dpt_32) as dpt_33, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral", "Glassdoor"
                            FROM
                                (SELECT COALESCE(abcdefghijklmno.dpt_29, p.dpt_30) as dpt_31, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth", "Employee Referral"
                                FROM
                                    (SELECT COALESCE(abcdefghijklmn.dpt_27, o.dpt_28) as dpt_29, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc", "Word of Mouth"
                                    FROM
                                        (SELECT COALESCE(abcdefghijklm.dpt_25, n.dpt_26) as dpt_27, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder", "Social Networks - Facebook Twitter etc"
                                        FROM
                                            (SELECT COALESCE(abcdefghijkl.dpt_23, m.dpt_24) as dpt_25, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other", "Careerbuilder"
                                            FROM
                                                (SELECT COALESCE(abcdefghijk.dpt_21, l.dpt_22) as dpt_23, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com", "Other"
                                                FROM
                                                    (SELECT COALESCE(abcdefghij.dpt_19, k.dpt_20) as dpt_21, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search", "Monster.com"
                                                    FROM
                                                        (SELECT COALESCE(abcdefghi.dpt_17, j.dpt_18) as dpt_19, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google", "Internet Search"
                                                        FROM
                                                            (SELECT COALESCE(abcdefgh.dpt_15, i.dpt_16) as dpt_17, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo", "Pay Per Click - Google"
                                                            FROM
                                                                (SELECT COALESCE(abcdefg.dpt_13, h.dpt_14) as dpt_15, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine", "Search Engine - Google Bing Yahoo"
                                                                FROM
                                                                    (SELECT COALESCE(abcdef.dpt_11, g.dpt_12) as dpt_13, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads", "Newspager/Magazine"
                                                                    FROM
                                                                        (SELECT COALESCE(abcde.dpt_9, f.dpt_10) as dpt_11, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click", "MBTA ads"
                                                                        FROM
                                                                            (SELECT COALESCE(abcd.dpt_7, e.dpt_8) as dpt_9, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard", "Pay Per Click"
                                                                            FROM
                                                                                (SELECT COALESCE(abc.dpt_5, d.dpt_6) as dpt_7, "Company Intranet - Partner", "Professional Society", "On-line Web application", "Billboard"
                                                                                FROM
                                                                                    (SELECT COALESCE(ab.dpt_3, c.dpt_4) as dpt_5, "Company Intranet - Partner", "Professional Society", "On-line Web application"
                                                                                    FROM
                                                                                        (SELECT COALESCE(a.dpt_1, b.dpt_2) as dpt_3, "Company Intranet - Partner", "Professional Society"
                                                                                        FROM
                                                                                            (SELECT department as dpt_1, COUNT(es) as "Company Intranet - Partner" FROM k_req WHERE es = 'Company Intranet - Partner' GROUP BY dpt_1) a 
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_2, COUNT(es) as "Professional Society" FROM k_req WHERE es = 'Professional Society' GROUP BY dpt_2) b
                                                                                            ON 1 = 2) ab
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_4, COUNT(es) as "On-line Web application" FROM k_req WHERE es = 'On-line Web application' GROUP BY dpt_4) c
                                                                                            ON 1 = 2) abc
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_6, COUNT(es) as "Billboard" FROM k_req WHERE es = 'Billboard' GROUP BY dpt_6) d
                                                                                            ON 1 = 2) abcd
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_8, COUNT(es) as "Pay Per Click" FROM k_req WHERE es = 'Pay Per Click' GROUP BY dpt_8) e
                                                                                            ON 1 = 2) abcde
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_10, COUNT(es) as "MBTA ads" FROM k_req WHERE es = 'MBTA ads' GROUP BY dpt_10) f
                                                                                            ON 1 = 2) abcdef
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_12, COUNT(es) as "Newspager/Magazine" FROM k_req WHERE es = 'Newspager/Magazine' GROUP BY dpt_12) g
                                                                                            ON 1 = 2) abcdefg
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_14, COUNT(es) as "Search Engine - Google Bing Yahoo" FROM k_req WHERE es = 'Search Engine - Google Bing Yahoo' GROUP BY dpt_14) h
                                                                                            ON 1 = 2) abcdefgh
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_16, COUNT(es) as "Pay Per Click - Google" FROM k_req WHERE es = 'Pay Per Click - Google' GROUP BY dpt_16) i
                                                                                            ON 1 = 2) abcdefghi
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_18, COUNT(es) as "Internet Search" FROM k_req WHERE es = 'Internet Search' GROUP BY dpt_18) j
                                                                                            ON 1 = 2) abcdefghij
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_20, COUNT(es) as "Monster.com" FROM k_req WHERE es = 'Monster.com' GROUP BY dpt_20) k
                                                                                            ON 1 = 2) abcdefghijk
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_22, COUNT(es) as "Other" FROM k_req WHERE es = 'Other' GROUP BY dpt_22) l
                                                                                            ON 1 = 2) abcdefghijkl
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_24, COUNT(es) as "Careerbuilder" FROM k_req WHERE es = 'Careerbuilder' GROUP BY dpt_24) m
                                                                                            ON 1 = 2) abcdefghijklm
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_26, COUNT(es) as "Social Networks - Facebook Twitter etc" FROM k_req WHERE es = 'Social Networks - Facebook Twitter etc' GROUP BY dpt_26) n
                                                                                            ON 1 = 2) abcdefghijklmn
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_28, COUNT(es) as "Word of Mouth" FROM k_req WHERE es = 'Word of Mouth' GROUP BY dpt_28) o
                                                                                            ON 1 = 2) abcdefghijklmno
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_30, COUNT(es) as "Employee Referral" FROM k_req WHERE es = 'Employee Referral' GROUP BY dpt_30) p
                                                                                            ON 1 = 2) abcdefghijklmnop
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_32, COUNT(es) as "Glassdoor" FROM k_req WHERE es = 'Glassdoor' GROUP BY dpt_32) q
                                                                                            ON 1 = 2) abcdefghijklmnopq
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_34, COUNT(es) as "Indeed" FROM k_req WHERE es = 'Indeed' GROUP BY dpt_34) r
                                                                                            ON 1 = 2) abcdefghijklmnopqr
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_36, COUNT(es) as "Vendor Referral" FROM k_req WHERE es = 'Vendor Referral' GROUP BY dpt_36) s
                                                                                            ON 1 = 2) abcdefghijklmnopqrs
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_38, COUNT(es) as "Website Banner Ads" FROM k_req WHERE es = 'Website Banner Ads' GROUP BY dpt_38) t
                                                                                            ON 1 = 2) abcdefghijklmnopqrst
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_40, COUNT(es) as "On-campus Recruiting" FROM k_req WHERE es = 'On-campus Recruiting' GROUP BY dpt_40) u
                                                                                            ON 1 = 2) abcdefghijklmnopqrstu
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_42, COUNT(es) as "Information Session" FROM k_req WHERE es = 'Information Session' GROUP BY dpt_42) v
                                                                                            ON 1 = 2) abcdefghijklmnopqrstuv
                                                                                            FULL OUTER JOIN
                                                                                            (SELECT department as dpt_44, COUNT(es) as "Diversity Job Fair" FROM k_req WHERE es = 'Diversity Job Fair' GROUP BY dpt_44) w
                                                                                            ON 1 = 2 
                                                                                            )
       SELECT
    
    dpt_45 as department,
    
    CASE WHEN "Company Intranet - Partner" IS NULL THEN 0 ELSE "Company Intranet - Partner" END,
    CASE WHEN "Professional Society" IS NULL THEN 0 ELSE "Professional Society" END,
    CASE WHEN "On-line Web application" IS NULL THEN 0 ELSE "On-line Web application" END,
    CASE WHEN "Billboard" IS NULL THEN 0 ELSE "Billboard" END,
    CASE WHEN "Pay Per Click" IS NULL THEN 0 ELSE "Pay Per Click" END, 
    CASE WHEN "MBTA ads" IS NULL THEN 0 ELSE "MBTA ads" END,
    CASE WHEN "Newspager/Magazine" IS NULL THEN 0 ELSE "Newspager/Magazine" END,
    CASE WHEN "Search Engine - Google Bing Yahoo" IS NULL THEN 0 ELSE "Search Engine - Google Bing Yahoo" END,
    CASE WHEN "Pay Per Click - Google" IS NULL THEN 0 ELSE "Pay Per Click - Google" END,
    CASE WHEN "Internet Search" IS NULL THEN 0 ELSE "Internet Search" END,
    CASE WHEN "Monster.com" IS NULL THEN 0 ELSE "Monster.com" END,
    CASE WHEN "Other" IS NULL THEN 0 ELSE "Other" END,
    CASE WHEN "Careerbuilder" IS NULL THEN 0 ELSE "Careerbuilder" END,
    CASE WHEN "Social Networks - Facebook Twitter etc" IS NULL THEN 0 ELSE "Social Networks - Facebook Twitter etc" END,
    CASE WHEN "Word of Mouth" IS NULL THEN 0 ELSE "Word of Mouth" END,
    CASE WHEN "Employee Referral" IS NULL THEN 0 ELSE "Employee Referral" END,
    CASE WHEN "Glassdoor" IS NULL THEN 0 ELSE "Glassdoor" END,
    CASE WHEN "Indeed" IS NULL THEN 0 ELSE "Indeed" END,
    CASE WHEN "Vendor Referral" IS NULL THEN 0 ELSE "Vendor Referral" END,
    CASE WHEN "Website Banner Ads" IS NULL THEN 0 ELSE "Website Banner Ads" END,
    CASE WHEN "On-campus Recruiting" IS NULL THEN 0 ELSE "On-campus Recruiting" END,
    CASE WHEN "Information Session" IS NULL THEN 0 ELSE "Information Session" END,
    CASE WHEN "Diversity Job Fair" IS NULL THEN 0 ELSE "Diversity Job Fair" END
        
    FROM tbl )                                                                                     
    
    SELECT 
    
    department,
    
    SUM("Company Intranet - Partner") AS "Company Intranet - Partner",
    SUM("Professional Society") AS "Professional Society",
    SUM("On-line Web application") AS "On-line Web application",
    SUM("Billboard") AS "Billboard",
    SUM("Pay Per Click") AS "Pay Per Click",
    SUM("MBTA ads") AS "MBTA ads",
    SUM("Newspager/Magazine") AS "Newspager/Magazine",
    SUM("Search Engine - Google Bing Yahoo") AS "Search Engine - Google Bing Yahoo",
    SUM("Pay Per Click - Google") AS "Pay Per Click - Google",
    SUM("Internet Search") AS "Internet Search",
    SUM("Monster.com") AS "Monster.com",
    SUM("Other") AS "Other",
    SUM("Careerbuilder") AS "Careerbuilder",
    SUM("Social Networks - Facebook Twitter etc") AS "Social Networks - Facebook Twitter etc",
    SUM("Word of Mouth") AS "Word of Mouth",
    SUM("Employee Referral") AS "Employee Referral",
    SUM("Glassdoor") AS "Glassdoor",
    SUM("Indeed") AS "Indeed",
    SUM("Vendor Referral") AS "Vendor Referral",
    SUM("Website Banner Ads") AS "Website Banner Ads",
    SUM("On-campus Recruiting") AS "On-campus Recruiting",
    SUM("Information Session") AS "Information Session",
    SUM("Diversity Job Fair") AS "Diversity Job Fair", 
    
    SUM("Company Intranet - Partner") 
    +
    SUM("Professional Society") 
    +
    SUM("On-line Web application") 
    +
    SUM("Billboard") 
    +
    SUM("Pay Per Click") 
    +
    SUM("MBTA ads") 
    +
    SUM("Newspager/Magazine") 
    +
    SUM("Search Engine - Google Bing Yahoo") 
    +
    SUM("Pay Per Click - Google") 
    +
    SUM("Internet Search") 
    +
    SUM("Monster.com") 
    +
    SUM("Other") 
    +
    SUM("Careerbuilder") 
    +
    SUM("Social Networks - Facebook Twitter etc") 
    +
    SUM("Word of Mouth") 
    +
    SUM("Employee Referral") 
    +
    SUM("Glassdoor") 
    +
    SUM("Indeed") 
    +
    SUM("Vendor Referral") 
    +
    SUM("Website Banner Ads") 
    +
    SUM("On-campus Recruiting") 
    +
    SUM("Information Session")
    +
    SUM("Diversity Job Fair") 

    as total
    
    FROM tbl_1
                 
    GROUP BY department)
    
    SELECT
    
    department, 
    
    ROUND("Company Intranet - Partner"/total,2)*100 as "Company Intranet - Partner",
    ROUND("Professional Society"/total,2) as "Professional Society",
    ROUND("On-line Web application"/total,2) as "On-line Web application",
    ROUND("Billboard"/total,2) as "Billboard",
    ROUND("Pay Per Click"/total,2) as "Pay Per Click",
    ROUND("MBTA ads"/total,2) as "MBTA ads",  
    ROUND("Newspager/Magazine"/total,2) as "Newspager/Magazine",
    ROUND("Search Engine - Google Bing Yahoo"/total,2) as "Search Engine - Google Bing Yahoo", 
    ROUND("Pay Per Click - Google"/total,2) as "Pay Per Click - Google",
    ROUND("Internet Search"/total,2) as "Internet Search",
    ROUND("Monster.com"/total,2) as "Monster.com",
    ROUND("Other"/total,2) as "Other",
    ROUND("Careerbuilder"/total,2) as "Careerbuilder" ,
    ROUND("Social Networks - Facebook Twitter etc"/total,2) as "Social Networks - Facebook Twitter etc",
    ROUND("Word of Mouth"/total,2) as "Word of Mouth",
    ROUND("Employee Referral"/total,2) as "Employee Referral",
    ROUND("Glassdoor"/total,2) as "Glassdoor" ,
    ROUND("Indeed"/total,2) as "Indeed" ,
    ROUND("Vendor Referral"/total,2) as "Vendor Referral",
    ROUND("Website Banner Ads"/total,2) as "Website Banner Ads",
    ROUND("On-campus Recruiting"/total,2) as "On-campus Recruiting",
    ROUND("Information Session"/total,2) as "Information Session",
    ROUND("Diversity Job Fair"/total,2) as "Diversity Job Fair",
    total
    
    FROM tbl_2                                                         
                                                                    
                                                                       
                                                                                            '''
                                                                              
                                                                                                    
department_ES = pd.read_sql(q29, connect)
department_ES

,department,Company Intranet - Partner,Professional Society,On-line Web application,Billboard,Pay Per Click,MBTA ads,Newspager/Magazine,Search Engine - Google Bing Yahoo,Pay Per Click - Google,...,Word of Mouth,Employee Referral,Glassdoor,Indeed,Vendor Referral,Website Banner Ads,On-campus Recruiting,Information Session,Diversity Job Fair,total
0,Production,0.0,0.07,0.0,0.06,0.0,0.07,0.08,0.11,0.05,...,0.06,0.08,0.04,0.00,0.03,0.02,0.05,0.01,0.08,208.0
1,Admin Offices,0.0,0.00,0.0,0.00,0.0,0.00,0.00,0.00,0.10,...,0.00,0.00,0.00,0.00,0.00,0.20,0.00,0.00,0.40,10.0
2,Executive Office,0.0,0.00,0.0,0.00,0.0,0.00,0.00,0.00,1.00,...,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1.0
3,IT/IS,2.0,0.08,0.0,0.00,0.0,0.00,0.00,0.02,0.02,...,0.00,0.26,0.10,0.16,0.16,0.00,0.02,0.04,0.08,50.0
4,Software Engineering,0.0,0.00,0.0,0.10,0.0,0.10,0.00,0.20,0.20,...,0.00,0.00,0.00,0.00,0.10,0.00,0.00,0.00,0.20,10.0
5,Sales,0.0,0.03,0.0,0.06,0.0,0.03,0.03,0.00,0.19,...,0.00,0.06,0.00,0.00,0.00,0.23,0.00,0.00,0.06,31.0

### Research 16:
Let's see within what limits relative to the minimum, average and maximum salaries are the actual salaries of workers by position. Since there is not enough data in the salary_grid table for all positions that are presented in the hr_dataset table, we will make an “extrapalatative” conclusion based on the data that is available.

In [324]:
q30 = '''
        WITH tbl AS
            (SELECT COALESCE(a.position, b.position) AS position, pay_rate, "Hourly Min", "Hourly Mid", "Hourly Max"
            FROM
                (SELECT position, ROUND(SUM("Pay Rate")/COUNT(position)) as pay_rate
                FROM  hr_dataset 
                GROUP BY  position) a
                LEFT JOIN
                (SELECT "Position" as position, "Hourly Min", "Hourly Mid", "Hourly Max"
                FROM  salary_grid) b
                ON a.position=b.position)
        SELECT
        AVG(pay_rate) as avg_pay_rate, 
        AVG("Hourly Min") AS avg_min, 
        AVG("Hourly Mid") AS avg_mid, 
        AVG("Hourly Max") AS avg_max
        FROM 
        tbl
        WHERE
        "Hourly Min" IS NOT NULL
        '''

bounce_candidates  = pd.read_sql(q30, connect)
bounce_candidates

   avg_pay_rate    avg_min    avg_mid    avg_max
0     35.444444  25.493333  32.426666  40.275556

### Conclusion:
According to the data, we see that the average real average salary by division is located almost in the middle between the average average salary and the average maximum salary by division.
This is good, because it means that the company’s managers have room to optimize wage costs, as well as a small gap to increase the wage fund, if necessary.

## Final recommendations:
1. Pay attention to the work of manager Michael Albert. Under his leadership there are employees whose quality of work leaves much to be desired.
2. Based on data from Study 4:
     - For the IT department, hire more employees, hire a good manager, so as not to overload employees with overtime work;
     - Create a career elevator within the company for production personnel;
3. Based on data from Study 7:
     - Another pointer to the fact that it is necessary to work out issues with the IT department: it is in first place in terms of “staff turnover”
4. In the production department, the following are candidates for dismissal: see Study 12
5. According to data from Study 13, it is clear that attracting talent through Careerbuilder and Pay Per Click resources can be stopped. These are the most expensive sources in terms of unit costs. Specialists (Production Technician I, Production Technician II) can be found through Search Engine - Google Bing Yahoo and Newspager/Magazine, through which they are much more likely to be found. + consider Social Networks as a candidate for termination of funding, since the channel is also ineffective.
6. Money from reducing funding for ineffective channels should be used for additional funding of top channels by department. The study shows the direction to which specific channels finance can be directed, for example, if it is advertising vacancies and payment, for example, for impressions or for places in search results. Fine-tuning this funding can be done using the table in Study 15.

## Tools for recruiting:
     - Table from Study 2 - correspondence between the position and statistically the most popular job resource.
     - Tables from Study 3:
             - correspondence between the vacancy resource and average work experience
             - Correspondence between the vacancy resource and average age
             - correspondence between the vacancy resource and the percentage of genders
     - Table from Study 8: Distribution by gender among departments.
     - Table from Study 9: Distribution of average age and salary by department.
## Tools for management decisions with existing personnel:
     - The tables from Study 5 can be used as a guide if there is a need to rotate managers between departments.
     - The table from Study 6 can help create quality targets by department
    
## Inferences:
  - Judging by Study 10, the average “staff turnover” rate for the company is average, which is generally good, but there is room for improvement. Again, it can get bigger by fixing problems in the IT department.
  - The company is quite young (according to the average age of the employee) - 30-35 years old - the largest age group
  - According to data from Study 16, we see that the average real average salary by division is almost halfway between the average average salary and the average maximum salary by division. This is good, because it means that the company’s managers have room to optimize wage costs, as well as a small gap to increase the wage fund, if necessary.